USE ChefDB;

-- 1. 시금치
INSERT INTO food VALUES(
    '시금치', 
    '시금치는 100g당 약 30kcal의 저열량 식품이면서도 비타민, 무기질, 식이섬유가 풍부한 "채소의 왕"입니다. 특히 뼈 건강, 빈혈 예방, 면역력 증진에 탁월한 효능을 가지고 있습니다', 
    4000, 
    '2026-10-17', 
    'M마트', 
    3, 
    '시금치.jpg'
);

-- 2. 콩나물
INSERT INTO food VALUES( 
    '콩나물', 
    '콩나물은 아스파라긴산, 비타민 C, 이소플라본, 양질의 단백질이 풍부한 저칼로리 채소입니다. 간 기능 개선 및 숙취 해소, 면역력 강화, 피부 미용, 그리고 갱년기 증상 완화와 뼈 건강에 매우 탁월한 효능을 가지고 있습니다.', 
    2500, 
    '2027-02-01', 
    'M마트', 
    5, 
    '콩나물.jpg'
);

-- 3. 당근
INSERT INTO food VALUES( 
    '당근', 
    '당근은 칼로리가 낮고 수분과 식이섬유가 풍부해 다이어트와 장 건강에 좋습니다. 특히 항산화 물질인 베타카로틴의 보고로, 체내에서 비타민 A로 전환되어 눈 건강과 면역력 증진에 탁월한 효과가 있습니다.', 
    2000, 
    '2027-12-02', 
    'GS마트', 
    7, 
    '당근.jpg'
);

-- 4. 양파
INSERT INTO food VALUES(
    '양파', 
    '양파는 수분이 약 90%를 차지하며, 칼로리가 낮고(100g당 약 42kcal) 퀘르세틴, 알리신, 크롬 등 강력한 항산화 성분과 미네랄이 풍부한 채소입니다.', 
    3000, 
    '2026-09-21', 
    '이마트', 
    3, 
    '양파.jpg'
);

-- 5. 감자
INSERT INTO food VALUES( 
    '감자', 
    '감자는 수분(약 80%)과 복합 탄수화물이 풍부한 알칼리성 식품입니다. 특히 사과의 약 3배에 달하는 비타민 C와 바나나보다 많은 칼륨이 들어있어 피로 해소와 나트륨 배출에 탁월합니다.', 
    2400, 
    '2027-03-15', 
    'M마트', 
    15, 
    '감자.jpg'
);

-- 6. 양배추
INSERT INTO food VALUES( 
    '양배추', 
    '양배추는 100g당 약 24kcal로 열량이 매우 낮으면서도 식이섬유가 풍부해 포만감이 뛰어난 채소입니다. 위 건강을 돕는 "비타민 U"와 "비타민 K"가 대표적인 영양소이며, 비타민 C, 칼슘, 엽산 등도 풍부하게 함유되어 있습니다.', 
    1800, 
    '2026-10-31', 
    '이마트', 
    2, 
    '양배추.jpg'
);

-- 7. 마늘
INSERT INTO food VALUES(
    '마늘', 
    '마늘은 약 400여 가지의 유익한 영양 성분을 함유한 슈퍼푸드입니다. 대표적인 핵심 성분은 "알린(Alliin)"과 비타민, 미네랄입니다.', 
    3400, 
    '2027-05-18', 
    'M마트', 
    20, 
    '마늘.jpg'
);

-- 8. 토마토
INSERT INTO food VALUES(
    '토마토', 
    '토마토는 수분과 식이섬유가 풍부하고 칼로리가 낮아(100g당 약 18~25kcal) 다이어트에 매우 이상적인 식품입니다. 비타민C, 비타민A, 칼륨 등이 고루 함유되어 있으며, 특히 강력한 항산화 물질인 라이코펜(Lycopene)이 함유되어 있습니다.', 
    2200, 
    '2027-04-12', 
    'G마트', 
    6, 
    '토마토.jpg'
);

-- 9. 계란
INSERT INTO food VALUES(
    '계란', 
    '계란은 비타민 C를 제외한 거의 모든 필수 영양소를 골고루 함유한 "완전식품"입니다. 대표적인 고단백, 저탄수화물 식품으로 근육 생성과 체중 관리에 탁월합니다.', 
    9900, 
    '2026-10-25', 
    '이마트', 
    30, 
    '계란.jpg'
);

-- 10. 버섯
INSERT INTO food VALUES( 
    '버섯', 
    '버섯은 "숲속의 보약"이라 불리는 고단백·저열량 식품으로, 수분(80~90%) 외에 단백질, 탄수화물, 식이섬유, 그리고 다양한 비타민과 미네랄이 풍부하게 함유되어 있습니다.', 
    1900, 
    '2027-10-31', 
    'M마트', 
    4, 
    '버섯.jpg'
);